## pandas 入门

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### pandas 数据结构介绍

In [2]:
obj = Series([1,2,3,4,5])

obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
print(obj.array)
print(obj.index)

<NumpyExtensionArray>
[np.int64(1), np.int64(2), np.int64(3), np.int64(4), np.int64(5)]
Length: 5, dtype: int64
RangeIndex(start=0, stop=5, step=1)

In [5]:
obj2 = Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
obj2

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [7]:
obj2['a']

np.int64(1)

In [12]:
obj2['b'] = 5
obj2[['a', 'b', 'c', 'd']]

a    1
b    5
c    3
d    4
dtype: int64

In [13]:
obj2[obj2 > 2]

b    5
c    3
d    4
dtype: int64

In [14]:
obj2 * 2

a     2
b    10
c     6
d     8
dtype: int64

In [15]:
np.exp(obj2)

a      2.718282
b    148.413159
c     20.085537
d     54.598150
dtype: float64

In [16]:
"b" in obj2

True

In [17]:
sdata = {
    "Ohio": 35000,
    "Texas": 71000,
    "Oregon": 16000,
    "Utah": 5000
}

obj = pd.Series(sdata)
obj

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
obj.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [20]:
states = ["California", "New York", "Texas", "Ohio"]

obj4 = Series(sdata, index=states)
obj4

California        NaN
New York          NaN
Texas         71000.0
Ohio          35000.0
dtype: float64

In [21]:
pd.isna(obj4)

California     True
New York       True
Texas         False
Ohio          False
dtype: bool

In [22]:
pd.notna(obj4)

California    False
New York      False
Texas          True
Ohio           True
dtype: bool

In [23]:
obj + obj4

California         NaN
New York           NaN
Ohio           70000.0
Oregon             NaN
Texas         142000.0
Utah               NaN
dtype: float64

In [25]:
obj4.name = "population"
obj4.index.name = "state"
obj4

state
California        NaN
New York          NaN
Texas         71000.0
Ohio          35000.0
Name: population, dtype: float64

In [26]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [27]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

DataFrame 是矩形的数据表，DataFrame 既有行索引也有列索引

In [29]:
data = {
    "state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada"],
    "year": [2000, 2001, 2002, 2001, 2002],
    "pop": [1.5, 1.7, 3.6, 2.4, 5.5]
}

frame = DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  5.5

In [30]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  5.5

In [31]:
frame.tail()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  5.5

In [32]:
DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  5.5

In [33]:
frame2 = DataFrame(data, columns=["year", "state", "pop", "debt"], index=["one", "two", "three", "four", "five"])

frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  5.5  NaN

In [34]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [35]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [36]:
frame2["state"]

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [37]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [38]:
frame2.debt = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  5.5  16.5

In [40]:
frame2.loc['two']

year     2001
state    Ohio
pop       1.7
debt     16.5
Name: two, dtype: object

In [41]:
frame2.iloc[1]

year     2001
state    Ohio
pop       1.7
debt     16.5
Name: two, dtype: object

In [43]:
frame2.debt = np.arange(5.)
frame2.debt

one      0.0
two      1.0
three    2.0
four     3.0
five     4.0
Name: debt, dtype: float64

In [45]:
val = Series([1, 2, 3], index=['one', 'two', 'three'])

frame2.debt = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   1.0
two    2001    Ohio  1.7   2.0
three  2002    Ohio  3.6   3.0
four   2001  Nevada  2.4   NaN
five   2002  Nevada  5.5   NaN

In [46]:
frame2["eastern"] = frame2.state == "Ohio"
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   1.0     True
two    2001    Ohio  1.7   2.0     True
three  2002    Ohio  3.6   3.0     True
four   2001  Nevada  2.4   NaN    False
five   2002  Nevada  5.5   NaN    False

In [47]:
del frame2["eastern"]
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [48]:
population_by_region = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
                        "Nevada": {2001: 2.4, 2002: 2.9}}

frame3 = pd.DataFrame(population_by_region)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [49]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [50]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [51]:
DataFrame(population_by_region, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [52]:
pdata = {
    "Ohio": frame3["Ohio"][:-1],
    "Nevada": frame3["Nevada"][:2]
}

DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [54]:
frame2.index.name = "year"
frame2.columns.name = "state"

frame2

state  year   state  pop  debt
year
one    2000    Ohio  1.5   1.0
two    2001    Ohio  1.7   2.0
three  2002    Ohio  3.6   3.0
four   2001  Nevada  2.4   NaN
five   2002  Nevada  5.5   NaN

In [55]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, 1.0],
       [2001, 'Ohio', 1.7, 2.0],
       [2002, 'Ohio', 3.6, 3.0],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 5.5, nan]], dtype=object)

In [56]:
labels = pd.Index(np.arange(3))
labels

Index([0, 1, 2], dtype='int64')

In [58]:
obj2 = Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [59]:
obj2.index is labels

True

In [60]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [61]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object')

In [62]:
"Ohio" in frame3.columns

True

### 基本功能

In [63]:
obj = Series([4,7,-5,3], index=['d','b','a','c'])
obj

d    4
b    7
a   -5
c    3
dtype: int64

In [65]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.0
b    7.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [66]:
obj3 = Series(["blue", "red", "green"], index=[0, 2, 4])
obj3

0     blue
2      red
4    green
dtype: object

In [67]:
obj3.reindex(range(6), method="ffill")

0     blue
1     blue
2      red
3      red
4    green
5    green
dtype: object

In [68]:
obj3

0     blue
2      red
4    green
dtype: object

In [69]:
frame = DataFrame(np.arange(12).reshape(3, 4), index=["a", "c", "d"], columns=["Ohio", "Texas", "California", "Nevada"])
frame

   Ohio  Texas  California  Nevada
a     0      1           2       3
c     4      5           6       7
d     8      9          10      11

In [71]:
frame.reindex(["a", "b", "c", "d"])

   Ohio  Texas  California  Nevada
a   0.0    1.0         2.0     3.0
b   NaN    NaN         NaN     NaN
c   4.0    5.0         6.0     7.0
d   8.0    9.0        10.0    11.0

In [72]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      5   NaN           6
d      9   NaN          10

In [74]:
frame.loc[["a", "c"], ["Ohio", "Texas"]]

   Ohio  Texas
a     0      1
c     4      5

In [82]:
obj7 = Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj7

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [84]:
obj7.drop("c")

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [85]:
obj7

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [87]:
data = pd.DataFrame(np.arange(16).reshape(4,4), index=["Ohio", "Colorado", "Utah", "New York"], columns=["one", "two", "three", "four"])
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [90]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [91]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [92]:
data.drop(["one", "two"], axis="columns")

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

In [93]:
obj = Series(np.arange(4.), index=["a", "b", "c", "d"])
obj["b"]

np.float64(1.0)

In [95]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [97]:
obj[["b", "c"]]

b    1.0
c    2.0
dtype: float64

In [98]:
obj[obj > 2]

d    3.0
dtype: float64

In [100]:
obj.loc[["a", "b"]]

a    0.0
b    1.0
dtype: float64

In [101]:
obj2 = Series(np.arange(4.), index=["a", "b", "c", "d"])
obj2.loc["b": "c"]

b    1.0
c    2.0
dtype: float64

In [104]:
obj2.loc["b": "c"] = 5
obj2

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [105]:
data = DataFrame(
    np.arange(16).reshape(4, 4),
    index = ['Ohio', 'Colorado', 'Utah', 'New York'],
    columns = ['one', 'two', 'three', 'four']
)

data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [106]:
data[["two", "three"]]

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [107]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [109]:
print(data['three'] > 5)
data[data['three'] > 5]

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [110]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [111]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [112]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [113]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [114]:
data.loc[['Colorado', 'Utah'], ['two', 'three']]

          two  three
Colorado    5      6
Utah        9     10

In [117]:
data.loc[:, "one"] = 1
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [119]:
data.iloc[2] = 5
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [120]:
data.loc[data['four'] > 5] = -1
data

          one  two  three  four
Ohio        1    0      0     0
Colorado   -1   -1     -1    -1
Utah        5    5      5     5
New York   -1   -1     -1    -1

In [121]:
data.loc[data.three == 5, 'three'] = 10
data

          one  two  three  four
Ohio        1    0      0     0
Colorado   -1   -1     -1    -1
Utah        5    5     10     5
New York   -1   -1     -1    -1

In [122]:
s1 = Series([1, 2, 3], index=['a', 'b', 'c'])
s2 = Series([1, 2, 3], index=['b', 'c', 'd'])

s1 + s2

a    NaN
b    3.0
c    5.0
d    NaN
dtype: float64

In [126]:
df1 = DataFrame(np.arange(9.).reshape(3, 3), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [127]:
df1 = DataFrame(np.arange(12.).reshape(3, 4), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape(4, 5), columns=list('abcde'))

df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [129]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [131]:
arr = np.arange(10).reshape(2, 5)
arr - arr[0]

array([[0, 0, 0, 0, 0],
       [5, 5, 5, 5, 5]])

In [132]:
frame = DataFrame(np.random.standard_normal((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -1.343538 -0.098949  0.684358
Ohio    1.262728  0.096083  1.538470
Texas   1.334821  0.219676  0.078940
Oregon -1.036060 -0.352597  1.229831

In [133]:
np.abs(frame)

               b         d         e
Utah    1.343538  0.098949  0.684358
Ohio    1.262728  0.096083  1.538470
Texas   1.334821  0.219676  0.078940
Oregon  1.036060  0.352597  1.229831

In [134]:
frame

               b         d         e
Utah   -1.343538 -0.098949  0.684358
Ohio    1.262728  0.096083  1.538470
Texas   1.334821  0.219676  0.078940
Oregon -1.036060 -0.352597  1.229831

In [135]:
def f1(x):
    return x.max() - x.min()

frame.apply(f1)

b    2.678359
d    0.572272
e    1.459530
dtype: float64

In [136]:
frame.apply(f1, axis='columns')

Utah      2.027896
Ohio      1.442386
Texas     1.255881
Oregon    2.265891
dtype: float64

In [137]:
def f2(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

frame.apply(f2)

            b         d        e
min -1.343538 -0.352597  0.07894
max  1.334821  0.219676  1.53847

In [139]:
def my_format(x):
    return f"{x:.2f}"

frame.map(my_format)

            b      d     e
Utah    -1.34  -0.10  0.68
Ohio     1.26   0.10  1.54
Texas    1.33   0.22  0.08
Oregon  -1.04  -0.35  1.23

In [140]:
obj = Series([1, 2, 3, 4, 5], index=['e', 'b', 'c', 'd', 'a'])
obj.sort_index()

a    5
b    2
c    3
d    4
e    1
dtype: int64

In [141]:
frame = DataFrame(np.arange(8).reshape(2, 4), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [142]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [143]:
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [144]:
obj = Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [145]:
obj = Series([1, np.nan, 3, np.nan, 5])
obj.sort_values()

0    1.0
2    3.0
4    5.0
1    NaN
3    NaN
dtype: float64

In [146]:
obj.sort_values(na_position='first')

1    NaN
3    NaN
0    1.0
2    3.0
4    5.0
dtype: float64

In [147]:
frame = DataFrame({
    'b': [4, 7, -3, 2],
    'a': [0, 1, 0, 1]
})

frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [148]:
frame.sort_values(['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [151]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

### 描述性统计的汇总和计算

In [152]:
df = DataFrame(
    [[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
    index=['a', 'b', 'c', 'd'],
    columns=['one', 'two']
)

df.sum()

one    9.25
two   -5.80
dtype: float64

In [154]:
print(df)
df.sum(axis='columns')

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [155]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [156]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [157]:
df.idxmin()

one    d
two    b
dtype: object

In [158]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [160]:
print(df)
df.describe()

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [163]:
obj = Series(["a", "b", "c", "d"] * 4)
obj.describe()

count     16
unique     4
top        a
freq       4
dtype: object

In [166]:
price = pd.read_pickle("examples/yahoo_price.pkl")
volume = pd.read_pickle("examples/yahoo_volume.pkl")

returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [168]:
returns["MSFT"].corr(returns["IBM"])

np.float64(0.49976361144151166)

In [169]:
returns["MSFT"].cov(returns["IBM"])

np.float64(8.870655479703549e-05)

In [170]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [171]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [172]:
returns.corrwith(returns.IBM)

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [173]:
obj = Series(["a", "a", "b", "c"] * 4)

uniques = obj.unique()
uniques

array(['a', 'b', 'c'], dtype=object)

In [174]:
obj.value_counts()

a    8
b    4
c    4
Name: count, dtype: int64

In [175]:
pd.value_counts(obj.to_numpy(), sort=False)

/var/folders/7v/zmfj4myd5gj8ttpbq6ynmdm80000gn/T/ipykernel_86133/164454357.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy(), sort=False)

a    8
b    4
c    4
Name: count, dtype: int64

In [178]:
mask = obj.isin(['b', 'c'])
mask

0     False
1     False
2      True
3      True
4     False
5     False
6      True
7      True
8     False
9     False
10     True
11     True
12    False
13    False
14     True
15     True
dtype: bool

In [179]:
obj[mask]

2     b
3     c
6     b
7     c
10    b
11    c
14    b
15    c
dtype: object

In [180]:
uniques_values = pd.Series(['c', 'b', 'a'])
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
pd.Index(uniques_values).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In [181]:
data = DataFrame({
    'Qu1': [1, 3, 4, 3, 4],
    'Qu2': [2, 3, 1, 2, 3],
    'Qu3': [1, 5, 2, 4, 4]
})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [183]:
data['Qu1'].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [188]:
result = data.apply(pd.value_counts).fillna(0)
result

/var/folders/7v/zmfj4myd5gj8ttpbq6ynmdm80000gn/T/ipykernel_86133/1382616601.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [189]:
data = DataFrame({
    'year': [2013, 2014, 2015, 2016, 2017],
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9]
})

data.value_counts()

year  state   pop
2013  Ohio    1.5    1
2014  Ohio    1.7    1
2015  Ohio    3.6    1
2016  Nevada  2.4    1
2017  Nevada  2.9    1
Name: count, dtype: int64